# BWT - Deep Learning Track
## Starting with Pandas, Series and DataFrame
### Adil Mubashir Chaudhry

Pandas is a Python library that provides high-level data manipulation tools for data analysis. It is built on top of NumPy and provides two main data structures: Series and DataFrame.
A Series is a one-dimensional array-like object that can hold any data type

In [6]:
import pandas as pd
import numpy as np

In [3]:
series = pd.Series([1, 2, 3, 4])
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
people = {'name': ['Ali', 'Adil', 'Umer', 'Haider'],
        'age': [23, 24, 27, 20],
        'city': ['Islamabad', 'Bahawalpur', 'Rawalpindi', 'Multan']}
df = pd.DataFrame(people)
df

     name  age        city
0     Ali   23   Islamabad
1    Adil   24  Bahawalpur
2    Umer   27  Rawalpindi
3  Haider   20      Multan

In [8]:
df.name

0       Ali
1      Adil
2      Umer
3    Haider
Name: name, dtype: object

In [10]:
df.iloc[:2]

   name  age        city
0   Ali   23   Islamabad
1  Adil   24  Bahawalpur

In [13]:
df.loc[df['name'] == 'Adil']

   name  age        city
1  Adil   24  Bahawalpur

In [14]:
df.shape

(4, 3)

In [7]:
arr = np.array([1, 2, 3, 4])
s = pd.Series(arr)
s

0    1
1    2
2    3
3    4
dtype: int32

In [21]:
data2 = {'name': ['Ahmed', 'Haseeb'],
        'age': [33, 14],
        'city': ['Faisalabad', 'Lahore']}

df2 = pd.DataFrame(data2)
df = pd.merge(df , df2 , how='outer')
df

     name  age        city
0     Ali   23   Islamabad
1    Adil   24  Bahawalpur
2    Umer   27  Rawalpindi
3  Haider   20      Multan
4   Ahmed   33  Faisalabad
5  Haseeb   14      Lahore

In [22]:
df['age'].mean()

23.5

In [23]:
df.count()

name    6
age     6
city    6
dtype: int64